## Common Data Types

---


![Dir](https://www.arsys.es/blog/file/uploads/2018/06/postgresql.jpg)

PostgreSQL posee un conjunto de tipos de datos nativos. Algunos de los mas comunes son:

- Data de tipo texto
    - CHAR
    - VARCHAR
    - TEXT
- Data de tipo numerico
    - INT
    - Decimal
- Data de tipo fecha
    - DATE
    - TIME
    - TIMESTAMP
    - INTERVAL
- De tipo Array
    - ARRAY

Es importante que al analizar una base de datos u sustraer toda informacion... sepamos las caracteristicas de los tipos de datos que manejaremos. 

Una practica comun para determinar el tipo de datos que posse una tabla es utilizando la clausula `INFORMATION_SCHEMA`. Podemos escoger los campos interesados dentro de esta estructura.

---

### Lineas de Configuracion

*Lineas utilizadas para conectarse desde jupyter a la base de datos DVD RENTAL**


---

In [6]:
import psycopg2
import sqlalchemy as sqla
engine = sqla.create_engine("postgresql://postgres:Panama2021@localhost:5433/dvdrental")
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@dvdrental'

:hand: **More Info** 

- [Exec SQL in JupyterNB](https://magnimindacademy.com/blog/how-to-use-postgresql-in-a-jupyter-notebook)
- [Stackoverflow Problems](https://stackoverflow.com/questions/48841505/attributeerror-nonetype-object-has-no-attribute-instantiate-plugins-while)

In [27]:
%sql SELECT column_name, data_type FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name='customer' LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('active', 'integer'),
 ('store_id', 'smallint'),
 ('create_date', 'date'),
 ('last_update', 'timestamp without time zone'),
 ('customer_id', 'integer')]

### Data and time data types

![](https://2.bp.blogspot.com/-LONRq7AQi9w/WK224t6IGII/AAAAAAACepM/_mdswSSSNAIPUm5J_Iefb1LwFnj78jsWACLcB/s1600/iso-8601-skitch.png)

PostgreSQL maneja diferentes tipo de datos de tiempo, es comun que encontremos el tipo de dato `TIMESTAMP`, el cual utiliza el formato **ISO-8601**  que tiene como finalidad establecer una fecha, hora y momento exacto de un registro determinado. Podriamos decir que `TIMESTAMP` utiliza dos formatos de tiempo [`TIME` y `DATE`] y los podemos encontrar en reemplazo de timestamp. 

- **TIME**: se utiliza para registrar hora exacta de un registro e.g: [`08:14:52`]
- **DATE**: tipo de dato utilizado para guardar fecha de un registro e.g [`2006-02-14`]

Otro data type es `INTERVAL`, que funciona de la mano junto a los datos de tipo fecha; en especial cuando queremos agregar o sustraer un intervalo determinado de tiempo.

> `TIMESTAMP` puede contener o no la zona horaria , sin embargo es buena practica NO utilizar la zona horaria por convencion.

In [28]:
#DATE DATA TYPE
%sql SELECT create_date FROM customer LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[(datetime.date(2006, 2, 14),),
 (datetime.date(2006, 2, 14),),
 (datetime.date(2006, 2, 14),),
 (datetime.date(2006, 2, 14),),
 (datetime.date(2006, 2, 14),)]

`Time` data type

![](https://www.postgresqltutorial.com/wp-content/uploads/2017/02/PostgreSQL-TIME-Data-Type.png)

In [46]:
#Adding 3 days to current last_update
%sql SELECT last_update + INTERVAL '3 DAYS' FROM CUSTOMER LIMIT 10

 * postgresql://postgres:***@localhost:5433/dvdrental
10 rows affected.

[(datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),),
 (datetime.datetime(2013, 5, 29, 14, 49, 45, 738000),)]

### Arrays

![Arrays](https://linuxhint.com/wp-content/uploads/2022/03/How-to-Use-Postgres-4.png)

Al igual que los lenguajes de programacion, es posible que trabajemos con arrays uni-dimensionales o multi-dimensionales. Crearemos una tabla e insertaremos los valores con la finalidad de hacer un recorderis de la forma standard en como manejamos este tipo de acciones

In [48]:
%sql CREATE TABLE sample_1 ( email text, number int)
%sql INSERT INTO sample_1 (email, number) VALUES ('email@example.com', 67119000)
%sql SELECT * FROM sample_1

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('email@example.com', 67119000)]

Creemos ahora una tabla con array uni-dimensional y multidimensional.

In [64]:
%sql CREATE TABLE sample_2 (first_name text, emails text [][], numbers int[])
%sql INSERT INTO sample_2 (first_name, emails, numbers) VALUES ('John', '{{"work","workmail@sample.com"},{"personal","personalmail@sample.com"}}', '{"9981010", "67679999"}')
%sql INSERT INTO sample_2 (first_name, emails, numbers) VALUES ('Doe', '{{"personal","personal_2@yahoo.com"},{"assistant","personalAssistant@corp.com"}}', '{"773200","123410"}')
%sql SELECT * FROM sample_2

 * postgresql://postgres:***@localhost:5433/dvdrental
Done.
 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost:5433/dvdrental
2 rows affected.

[('John', [['work', 'workmail@sample.com'], ['personal', 'personalmail@sample.com']], [9981010, 67679999]),
 ('Doe', [['personal', 'personal_2@yahoo.com'], ['assistant', 'personalAssistant@corp.com']], [773200, 123410])]

La columna emails contiene un array multi-dimensional y en cambio la columna numbers contiene un array unidimensional, basicamente la estructura para ingresar datos a un registro con array es la siguiente.

```sql
    (   'single_value' ,
        '{{"value_1_1", "value_1_2"}, {"value_2_1", "value_2_2"}}',
        '{"single_1","single_2"}'
    )
```


Podemos consultar la tabla de distintas formas una de ellas es utilizando dos **square brackets**.Para buscar cadenas de texto dentro de los arrays podemos utilizar la funcion `ANY()` o `@> ARRAY['']`

In [65]:
#ACCESING ARRAY
%sql SELECT first_name AS Name, emails[1][1] AS Type_mail, emails[1][2] as Email FROM sample_2 LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
2 rows affected.

[('John', 'work', 'workmail@sample.com'),
 ('Doe', 'personal', 'personal_2@yahoo.com')]

In [76]:
#Searching IN ARRAY with SQUARE_BRACKETS
%sql SELECT first_name , emails[1][1], emails[1][2] FROM sample_2 WHERE emails[1][1] = 'personal'

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('Doe', 'personal', 'personal_2@yahoo.com')]

In [85]:
#Searching IN ARRAY with ANY
%sql SELECT first_name , emails[1][1] as Type, emails[1][2], numbers as Email FROM sample_2 WHERE  'personal' = ANY(emails)

 * postgresql://postgres:***@localhost:5433/dvdrental
2 rows affected.

[('John', 'work', 'workmail@sample.com', [9981010, 67679999]),
 ('Doe', 'personal', 'personal_2@yahoo.com', [773200, 123410])]

In [86]:
#SEARCHING WITH OPERATOR @>
%sql SELECT first_name, emails, numbers FROM sample_2 WHERE emails @> ARRAY['assistant']

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('Doe', [['personal', 'personal_2@yahoo.com'], ['assistant', 'personalAssistant@corp.com']], [773200, 123410])]

Como vimos podemos usar distintos operadores para realizar una busqueda dentro del array ya sea UNI-dimension o MULTI-dimension. Luego de esto depende de las columnas que deseamos mostrar.